# Data wragling (joining)
Group by

Handling missing values

In [38]:
import numpy as np
import pandas as pd
data=pd.Series(np.random.randn(12),
              index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd','c','e','f'],
                    [1,2,3,1,2,3,1,2,3,3,4,2]])
data

a  1   -0.098237
   2    0.174504
   3    0.536958
b  1   -0.370171
   2   -0.300586
c  3   -0.128441
   1   -1.039453
d  2   -0.075535
   3    0.860120
c  3    0.401619
e  4    1.119001
f  2    0.735187
dtype: float64

In [39]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('c', 3),
            ('c', 1),
            ('d', 2),
            ('d', 3),
            ('c', 3),
            ('e', 4),
            ('f', 2)],
           )

In [40]:
#you can easyly extract 
data['c']

3   -0.128441
1   -1.039453
3    0.401619
dtype: float64

In [47]:
data[:,2]

a    0.174504
b   -0.300586
d   -0.075535
f    0.735187
dtype: float64

In [51]:
data.loc[['b','f']]

b  1   -0.370171
   2   -0.300586
f  2    0.735187
dtype: float64

In [66]:
data_1=pd.DataFrame(np.arange(12).reshape((4,3)),
                   index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                   columns=[['Ohio', 'Ohio', 'Colorado'],
                            ['Green', 'Red', 'Green']])
data_1

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [70]:
data_1.index.names=['key1','key2'] 
#data_1.index.names=['state','color'] 
data_1

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [71]:
data_1.index.names=['state','color'] 
data_1

             Ohio     Colorado
            Green Red    Green
state color
a     1         0   1        2
      2         3   4        5
b     1         6   7        8
      2         9  10       11

In [72]:
data_1['Colorado']

             Green
state color
a     1          2
      2          5
b     1          8
      2         11

In [73]:
data_1['Ohio']

             Green  Red
state color
a     1          0    1
      2          3    4
b     1          6    7
      2          9   10

In [80]:
data_1['Ohio']='ali'
data_1

             Ohio      Colorado
            Green  Red    Green
state color
a     1       ali  ali        2
      2       ali  ali        5
b     1       ali  ali        8
      2       ali  ali       11